<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Defaults
    |--------------------------------------------------------------------------
    |
    | 此选项控制默认的身份验证“保护”和密码您的应用程序的重置选项。您可以更改这些默认值的要求，
      但他们是一个完美的开始，对大多数应用程序。
    |
    */

    'defaults' => [
        'guard' => 'web',
        'passwords' => 'users',
    ],

    /*
    |--------------------------------------------------------------------------
    | Authentication Guards
    |--------------------------------------------------------------------------
    |
    接下来，您可以为您的应用程序定义每个身份验证保护。
    当然，已经为您定义了一个很好的默认配置这里的使用会话存储和有说服力的用户提供者。
    所有身份验证驱动程序都有一个用户提供者。这就定义了用户实际上是从数据库或其他存储中检索出来的这个应用程序使用|机制来持久化用户的数据。
    
    | Supported: "session", "token"
    |
    */
    //存储用户认证信息
    'guards' => [
        'web' => [
            'driver' => 'session',
            'provider' => 'users',
        ],

        'api' => [
            'driver' => 'token',
            'provider' => 'users',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | 用户服务提供商 
    |--------------------------------------------------------------------------
    |
    | 所有身份验证驱动程序都有一个用户提供者。这就定义了
    |用户实际上是从数据库或其他存储中检索出来的这个应用程序使用|机制来持久化用户的数据。
    |
    | 如果您有多个用户表或模型，您可以配置多个表示每个模型/表的源。这些来源可能将分配给您定义的任何额外的身份验证保护。
    |
    | Supported: "database", "eloquent"
    |
    */
    //存取数据
    'providers' => [
        'users' => [
            'driver' => 'eloquent',
            'model' => App\User::class,
        ],

        // 'users' => [
        //     'driver' => 'database',
        //     'table' => 'users',
        // ],
    ],

    /*
    |--------------------------------------------------------------------------
    |重置密码
    |--------------------------------------------------------------------------
    |
    | 您可以指定多个密码重置配置，如果您有更多在应用程序中有多个用户表或模型
    |单独的密码重置设置基于特定的用户类型。
    |
    |过期时间是重置令牌应该占用的分钟数
    | 被认为是有效的。这个安全特性保持令牌的生命周期很短
    | 他们被猜测的时间更少了。您可以根据需要更改。
    |
    */

    'passwords' => [
        'users' => [
            'provider' => 'users',
            'table' => 'password_resets',
            'expire' => 60,
        ],
    ],

];
